### Read csv

In [8]:
import pandas as pd

data = pd.read_csv('data1/employees.csv', sep=';')
data.columns
print(data.shape)
data.head()

(107, 11)

,employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id,department_id
0,108,Nancy,Greenberg,NGREENBE,515.124.4569,1994-08-17 00:00:00,FI_MGR,12000.0,NaN,101.0,100
1,109,Daniel,Faviet,DFAVIET,515.124.4169,1994-08-16 00:00:00,FI_ACCOUNT,9000.0,NaN,108.0,100
2,110,John,Chen,JCHEN,515.124.4269,1997-09-28 00:00:00,FI_ACCOUNT,8200.0,NaN,108.0,100
3,111,Ismael,Sciarra,ISCIARRA,515.124.4369,1997-09-30 00:00:00,FI_ACCOUNT,7700.0,NaN,108.0,100
4,112,Jose Manuel,Urman,JMURMAN,515.124.4469,1998-03-07 00:00:00,FI_ACCOUNT,7800.0,NaN,108.0,100

### Find length of VARCHAR attributes

In [9]:
maxLenFirstName = 0
maxLenLastName = 0
maxLenPhoneNumber = 0
maxLenJobId = 0
for row in data.values:
  maxLenFirstName=max(maxLenFirstName,len(row[1]))
  maxLenLastName=max(maxLenLastName,len(row[2]))
  maxLenPhoneNumber=max(maxLenPhoneNumber,len(row[4]))
  maxLenJobId=max(maxLenJobId,len(row[6]))
print(maxLenFirstName, maxLenLastName, maxLenPhoneNumber, maxLenJobId)

11 11 18 10

### Set of values for partition column

In [10]:
data['department_id'].drop_duplicates()

0     100
6      50
31     80
Name: department_id, dtype: int64

# Data2

In [12]:
data = pd.read_csv('data2/employees.csv', sep=',')
data.columns
print(data.shape)
data.head()

(331603, 8)

,emp_no,birth_date,first_name,last_name,gender,hire_date,dept_no,from_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,d005,1986-06-26
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,d007,1996-08-03
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,d004,1995-12-03
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,d004,1986-12-01
4,10005,1955-01-21,Kyoichi,Maliniak,M,1989-09-12,d003,1989-09-12

In [15]:
sorted(data['dept_no'].drop_duplicates())

['d001', 'd002', 'd003', 'd004', 'd005', 'd006', 'd007', 'd008', 'd009']